<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b8e4c9f2abfdf8d5a34bb0a7659f7e80e0f6ac88a70b772c77a77451552b4633","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1324 at https://github.com/cal-itp/data-infra/actions/runs/20861321912","plan_out_hash":"3929259b9787fdece4a357a3b5b0e3986867b7bc2f3eb453b1ac8851d019cd78","plan_hash":"2cf8d7d1c275da417acd15416da2ed03baf2b924c1417abac322f5206589dee6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "xPDLGw==" -> (known after apply)
!~      detect_md5hash      = "FKSUwC+t3q2jKSkl9TCQcw==" -> "different hash"
!~      generation          = 1767398107874806 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_all_dag.py"
!~      md5hash             = "FKSUwC+t3q2jKSkl9TCQcw==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "88bjbw==" -> (known after apply)
!~      detect_md5hash      = "K8KpKd0QgIi+7tHQkcmuDw==" -> "different hash"
!~      generation          = 1767050873011557 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "K8KpKd0QgIi+7tHQkcmuDw==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "6qh2Fw==" -> (known after apply)
!~      detect_md5hash      = "7Ax9+ic+9/na9uq0q7cfUQ==" -> "different hash"
!~      generation          = 1767921649327824 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "7Ax9+ic+9/na9uq0q7cfUQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/define_day_of_week.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "CWM3cA==" -> (known after apply)
!~      detect_md5hash      = "YvfVPHIx1OMIXLV4MUp3RA==" -> "different hash"
!~      generation          = 1767398108765616 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/define_day_of_week.sql"
!~      md5hash             = "YvfVPHIx1OMIXLV4MUp3RA==" -> (known after apply)
        name                = "data/warehouse/macros/define_day_of_week.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/dim_stop_arrivals.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "0ADmtg==" -> (known after apply)
!~      detect_md5hash      = "yRixUFfYICRBIW7HWOW6yA==" -> "different hash"
!~      generation          = 1764958875770285 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
!~      md5hash             = "yRixUFfYICRBIW7HWOW6yA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_stop_time_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "VSq3uA==" -> (known after apply)
!~      detect_md5hash      = "j0kKt7KhwPdgrN0VdwwfDA==" -> "different hash"
!~      generation          = 1767054920208423 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
!~      md5hash             = "j0kKt7KhwPdgrN0VdwwfDA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "642FXg==" -> (known after apply)
!~      detect_md5hash      = "0K00p5Zv8HILpeN5yD3LBg==" -> "different hash"
!~      generation          = 1767921650891572 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "0K00p5Zv8HILpeN5yD3LBg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1324](https://github.com/cal-itp/data-infra/actions/runs/20861321912)